/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_toupper.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: dkajiwar <dkajiwar@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/05/01 20:05:47 by dkajiwar          #+#    #+#             */
/*   Updated: 2024/05/06 18:06:30 by dkajiwar         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_toupper(int c)
{
	if (96 < c && c < 123)
	{
		c -= 32;
	}
	return (c);
}

// #include <stdio.h>

// int main(){
// 	char x;
//     printf("一文字を入力してください: ");
//     scanf("%c", &x);

//     x = ft_toupper(x);
//     printf("%c が関数での処理を施した後の文字です。\n", x);

//     return 0;
// }